VoltCyclone/imxrtnsy/src/kmbox.c
			// Parse HID report descriptor to find exact X/Y/wheel
			// field positions and sizes — essential for correct merge.
			parse_mouse_layout(desc->ifaces[i].hid_report_desc,
			                   desc->ifaces[i].hid_report_desc_len);
		} else if (desc->ifaces[i].iface_protocol == 1 && !cached_kb_ep) {
			cached_kb_ep = ep;
		}
	}
}

void kmbox_poll(void)
{
	merged_this_cycle = false;

	// Kick DMA TX if there are pending bytes (non-blocking)
	tx_flush();

	// Clear line errors and reset parser if any occurred
	uint32_t stat = LPUART6_STAT;
	if (stat & (LPUART_STAT_OR | LPUART_STAT_FE | LPUART_STAT_NF)) {
		LPUART6_STAT = stat & (LPUART_STAT_OR | LPUART_STAT_FE | LPUART_STAT_NF);
		proto_mode = PROTO_IDLE;
		ferrum_pos = 0;
	}

	// Process pending click release timer
	if (inject.click_release_at && millis() >= inject.click_release_at) {
		inject.mouse_buttons &= ~inject.click_release_mask;
		inject.mouse_dirty = true;
		inject.click_release_mask = 0;
		inject.click_release_at = 0;
	}

	// Drain all DMA-received bytes from ring buffer
	uint16_t head = ((uint32_t)DMA_TCD0_DADDR - (uint32_t)dma_rx_ring) & (DMA_RX_RING_SIZE - 1);
	while (rx_tail != head) {
		uint8_t b = dma_rx_ring[rx_tail];
		rx_tail = (rx_tail + 1) & (DMA_RX_RING_SIZE - 1);
		rx_bytes_total++;

		switch (proto_mode) {
		case PROTO_IDLE:
			// Auto-detect protocol from first byte
			if (b == KMBOX_SYNC1) {
				// KMBox B: first sync byte 0x57
				proto_mode = PROTO_KMBOX;
				frame_checksum = b;
				kb_parse_state = KB_SYNC2;
			} else if (b == MAKCU_SYNC_BYTE) {
				// Makcu: sync byte 0x50
				proto_mode = PROTO_MAKCU;
				mk_parse_state = MK_CMD;
			} else if (b >= 0x20 && b < 0x7F) {
				// Printable ASCII — start Ferrum text line
				proto_mode = PROTO_FERRUM;
				ferrum_pos = 0;
				ferrum_line[ferrum_pos++] = (char)b;
			}
			// else: discard non-printable, non-sync bytes
			break;

		// ---- KMBox B binary protocol ----
		case PROTO_KMBOX:
			switch (kb_parse_state) {
			case KB_SYNC2:
				if (b == KMBOX_SYNC2) {
					frame_checksum += b;
					kb_parse_state = KB_CMD;
				} else if (b == KMBOX_SYNC1) {
					// Could be restart — keep sync1 checksum
					frame_checksum = b;
				} else {
					proto_mode = PROTO_IDLE;
				}
				break;
			case KB_CMD:
				frame_cmd = b;
				frame_checksum += b;
				kb_parse_state = KB_LEN;
				break;
			case KB_LEN:
				frame_len = b;
				frame_checksum += b;
				if (frame_len > KMBOX_MAX_PAYLOAD) {
					frames_err++;
					proto_mode = PROTO_IDLE;
				} else if (frame_len == 0) {
					kb_parse_state = KB_CHECKSUM;
				} else {
					frame_pos = 0;
					kb_parse_state = KB_PAYLOAD;
				}
				break;
			case KB_PAYLOAD:
				frame_buf[frame_pos++] = b;
				frame_checksum += b;
				if (frame_pos >= frame_len) {
					kb_parse_state = KB_CHECKSUM;
				}
				break;
			case KB_CHECKSUM:
				if ((frame_checksum & 0xFF) == b) {
					dispatch_kmbox_frame();
					frames_ok++;
				} else {
					frames_err++;
				}
				proto_mode = PROTO_IDLE;
				break;
			}
			break;

		// ---- Makcu binary protocol ----
		case PROTO_MAKCU:
			switch (mk_parse_state) {
			case MK_CMD:
				mk_cmd = b;
				mk_parse_state = MK_LEN_LO;
				break;
			case MK_LEN_LO:
				mk_len = b;
				mk_parse_state = MK_LEN_HI;
				break;
			case MK_LEN_HI:
				mk_len |= (uint16_t)b << 8;
				if (mk_len > MAKCU_MAX_PAYLOAD) {
					frames_err++;
					proto_mode = PROTO_IDLE;
				} else if (mk_len == 0) {
					dispatch_makcu_frame();
					frames_ok++;
					proto_mode = PROTO_IDLE;
				} else {
					mk_pos = 0;
					mk_parse_state = MK_PAYLOAD;
				}
				break;
			case MK_PAYLOAD:
				mk_buf[mk_pos++] = b;
				if (mk_pos >= mk_len) {
					dispatch_makcu_frame();
					frames_ok++;
					proto_mode = PROTO_IDLE;
				}
				break;
			}
			break;

		// ---- Ferrum text protocol ----
		case PROTO_FERRUM:
			if (b == '\n' || b == '\r') {
				// End of line — dispatch
				if (ferrum_pos > 0) {
					ferrum_line[ferrum_pos] = '\0';
					dispatch_ferrum_line();
				}
				ferrum_pos = 0;
				proto_mode = PROTO_IDLE;
			} else if (ferrum_pos < FERRUM_MAX_LINE - 1) {
				ferrum_line[ferrum_pos++] = (char)b;
			} else {
				// Line too long — discard
				ferrum_pos = 0;
				proto_mode = PROTO_IDLE;
			}
			break;
		}
	}

}

void kmbox_merge_report(uint8_t iface_protocol, uint8_t *report, uint8_t len)
{
	if (iface_protocol == 2) {
		// Cache actual report length for synthetic report construction
		if (cached_mouse_report_len == 0)
			cached_mouse_report_len = len;

		if (inject.mouse_dirty && mouse_layout.valid) {
			uint8_t doff = mouse_layout.data_off;

			// Buttons: OR into first data byte (standard for all mice)
			report[doff] |= inject.mouse_buttons;

			// X: read current, add injection, clamp, write back
			int32_t x_max = (1 << (mouse_layout.x_size - 1)) - 1;
			int32_t rx = read_report_field(report, mouse_layout.x_bit,
			                               mouse_layout.x_size, doff);
			int32_t mx = rx + inject.mouse_dx;
			if (mx > x_max) mx = x_max;
			if (mx < -x_max) mx = -x_max;
			write_report_field(report, mouse_layout.x_bit,
			                   mouse_layout.x_size, doff, mx);

			// Y: same pattern
			int32_t y_max = (1 << (mouse_layout.y_size - 1)) - 1;
			int32_t ry = read_report_field(report, mouse_layout.y_bit,
			                               mouse_layout.y_size, doff);
			int32_t my = ry + inject.mouse_dy;
			if (my > y_max) my = y_max;
			if (my < -y_max) my = -y_max;
			write_report_field(report, mouse_layout.y_bit,
			                   mouse_layout.y_size, doff, my);

			// Wheel (if present and non-zero injection)
			if (mouse_layout.wheel_bit != 0xFFFF && inject.mouse_wheel != 0) {
				int32_t w_max = (1 << (mouse_layout.wheel_size - 1)) - 1;
				int32_t rw = read_report_field(report, mouse_layout.wheel_bit,
				                               mouse_layout.wheel_size, doff);
				int32_t mw = rw + inject.mouse_wheel;
				if (mw > w_max) mw = w_max;
				if (mw < -w_max) mw = -w_max;
				write_report_field(report, mouse_layout.wheel_bit,
				                   mouse_layout.wheel_size, doff, mw);
			}

			inject.mouse_dx = 0;
			inject.mouse_dy = 0;
			inject.mouse_wheel = 0;
			inject.mouse_dirty = false;
			merged_this_cycle = true;
		}
	} else if (iface_protocol == 1 && inject.kb_dirty) {
		// Keyboard merge (8-byte boot report)
		if (len >= 8) {
			report[0] |= inject.kb_modifier;
			for (int i = 0; i < 6; i++) {
				if (inject.kb_keys[i] == 0) continue;
				bool found = false;
				for (int j = 2; j < 8; j++) {
					if (report[j] == inject.kb_keys[i]) {
						found = true;
						break;
					}
				}
				if (!found) {
					for (int j = 2; j < 8; j++) {
						if (report[j] == 0) {
							report[j] = inject.kb_keys[i];
							break;
						}
					}
				}
			}
		}
		merged_this_cycle = true;
	}
}

void kmbox_send_pending(void)
{
	if (merged_this_cycle) return;

	// Send synthetic mouse report if dirty (direct EP, no iface scan)
	if (inject.mouse_dirty && cached_mouse_ep && mouse_layout.valid) {
		uint8_t synth[16];
		memset(synth, 0, sizeof(synth));
		uint8_t doff = mouse_layout.data_off;
		if (doff) synth[0] = mouse_layout.report_id;
		synth[doff] = inject.mouse_buttons;

		// Clamp to field range and write at correct bit positions
		int32_t x_max = (1 << (mouse_layout.x_size - 1)) - 1;
		int32_t y_max = (1 << (mouse_layout.y_size - 1)) - 1;
		int32_t dx = inject.mouse_dx;
		int32_t dy = inject.mouse_dy;
		if (dx > x_max) dx = x_max;
		if (dx < -x_max) dx = -x_max;
		if (dy > y_max) dy = y_max;
		if (dy < -y_max) dy = -y_max;

		write_report_field(synth, mouse_layout.x_bit,
		                   mouse_layout.x_size, doff, dx);
		write_report_field(synth, mouse_layout.y_bit,
		                   mouse_layout.y_size, doff, dy);

