VoltCyclone/imxrtnsy/src/kmbox.c
		if (mouse_layout.wheel_bit != 0xFFFF && inject.mouse_wheel != 0) {
			int32_t w_max = (1 << (mouse_layout.wheel_size - 1)) - 1;
			int32_t w = inject.mouse_wheel;
			if (w > w_max) w = w_max;
			if (w < -w_max) w = -w_max;
			write_report_field(synth, mouse_layout.wheel_bit,
			                   mouse_layout.wheel_size, doff, w);
		}

		// Use actual report length seen from real device; fall back to maxpkt
		uint8_t rlen = cached_mouse_report_len;
		if (rlen == 0) rlen = (cached_mouse_maxpkt < 16) ? (uint8_t)cached_mouse_maxpkt : 16;
		usb_device_send_report(cached_mouse_ep, synth, rlen);

		inject.mouse_dx = 0;
		inject.mouse_dy = 0;
		inject.mouse_wheel = 0;
		inject.mouse_dirty = false;
	}

	// Send synthetic keyboard report if dirty (direct EP, no iface scan)
	if (inject.kb_dirty && cached_kb_ep) {
		uint8_t synth[8];
		synth[0] = inject.kb_modifier;
		synth[1] = 0;
		memcpy(&synth[2], inject.kb_keys, 6);
		usb_device_send_report(cached_kb_ep, synth, 8);
	}
}

void kmbox_inject_smooth(int16_t dx, int16_t dy)
{
	inject.mouse_dx += dx;
	inject.mouse_dy += dy;
	inject.mouse_dirty = true;
}

uint32_t kmbox_frame_count(void) { return frames_ok; }
uint32_t kmbox_error_count(void) { return frames_err; }
uint32_t kmbox_rx_byte_count(void) { return rx_bytes_total; }

// ---- Internal helpers ----

// Apply a mouse command result to the inject state.
// If use_smooth is true, movement goes through smooth queue.
static void apply_mouse_result(int16_t dx, int16_t dy, uint8_t buttons,
                               int8_t wheel, bool use_smooth)
{
	inject.mouse_buttons = buttons;
	inject.mouse_wheel += wheel;
	inject.mouse_dirty = true;

	if (use_smooth && (dx != 0 || dy != 0)) {
		smooth_inject(dx, dy);
	} else {
		inject.mouse_dx += dx;
		inject.mouse_dy += dy;
	}
}

// ---- KMBox B frame dispatch ----
static void dispatch_kmbox_frame(void)
{
	switch (frame_cmd) {
	case KMBOX_CMD_MOUSE_MOVE:
		if (frame_len >= 4) {
			inject.mouse_dx += (int16_t)(frame_buf[0] | (frame_buf[1] << 8));
			inject.mouse_dy += (int16_t)(frame_buf[2] | (frame_buf[3] << 8));
			inject.mouse_dirty = true;
		}
		break;

	case KMBOX_CMD_MOUSE_BUTTON:
		if (frame_len >= 1) {
			inject.mouse_buttons = frame_buf[0];
			inject.mouse_dirty = true;
		}
		break;

	case KMBOX_CMD_MOUSE_WHEEL:
		if (frame_len >= 1) {
			inject.mouse_wheel += (int8_t)frame_buf[0];
			inject.mouse_dirty = true;
		}
		break;

	case KMBOX_CMD_MOUSE_ALL:
		if (frame_len >= 6) {
			inject.mouse_buttons = frame_buf[0];
			inject.mouse_dx += (int16_t)(frame_buf[1] | (frame_buf[2] << 8));
			inject.mouse_dy += (int16_t)(frame_buf[3] | (frame_buf[4] << 8));
			inject.mouse_wheel += (int8_t)frame_buf[5];
			inject.mouse_dirty = true;
		}
		break;

	case KMBOX_CMD_KEYBOARD:
		if (frame_len >= 8) {
			inject.kb_modifier = frame_buf[0];
			memcpy(inject.kb_keys, &frame_buf[2], 6);
			inject.kb_dirty = true;
		}
		break;

	case KMBOX_CMD_KEYBOARD_REL:
		inject.kb_modifier = 0;
		memset(inject.kb_keys, 0, 6);
		inject.kb_dirty = true; // must send zero-report to release keys on host
		break;

	case KMBOX_CMD_SMOOTH_MOVE:
		if (frame_len >= 4) {
			int16_t x = (int16_t)(frame_buf[0] | (frame_buf[1] << 8));
			int16_t y = (int16_t)(frame_buf[2] | (frame_buf[3] << 8));
			smooth_inject(x, y);
		}
		break;

	case KMBOX_CMD_SMOOTH_CONFIG:
		if (frame_len >= 1) {
			smooth_set_max_per_frame((int16_t)frame_buf[0]);
		}
		break;

	case KMBOX_CMD_SMOOTH_CLEAR:
		smooth_clear();
		break;

	case KMBOX_CMD_PING:
		tx_enqueue(0xFE);
		break;

	default:
		break;
	}
}

// Enqueue a Makcu binary response: [0x50][cmd][len_lo][len_hi][payload...]
static void makcu_send_response(uint8_t cmd, const uint8_t *payload, uint8_t plen)
{
	tx_enqueue(MAKCU_SYNC_BYTE);
	tx_enqueue(cmd);
	tx_enqueue(plen & 0xFF);
	tx_enqueue((plen >> 8) & 0xFF);
	if (plen > 0)
		tx_enqueue_buf(payload, plen);
}

// ---- Makcu frame dispatch ----
static void dispatch_makcu_frame(void)
{
	makcu_result_t result;
	if (makcu_parse_command(mk_cmd, mk_buf, mk_len, &result)) {
		if (result.has_mouse) {
			apply_mouse_result(result.mouse_dx, result.mouse_dy,
			                   result.mouse_buttons, result.mouse_wheel,
			                   true);
		}
		if (result.has_keyboard) {
			inject.kb_modifier = result.kb_modifier;
			memcpy(inject.kb_keys, result.kb_keys, 6);
			inject.kb_dirty = true;
		}
		if (result.click_release) {
			// Schedule button release ~30ms after press
			inject.click_release_mask = result.mouse_buttons;
			inject.click_release_at = millis() + 30;
		}
		if (result.needs_response) {
			makcu_send_response(result.resp_cmd, result.resp_payload,
			                    result.resp_payload_len);
		}
	}
}

// ---- Ferrum line dispatch ----
static void dispatch_ferrum_line(void)
{
	ferrum_result_t result;
	if (ferrum_parse_line(ferrum_line, ferrum_pos, &result)) {
		if (result.has_mouse) {
			apply_mouse_result(result.mouse_dx, result.mouse_dy,
			                   result.mouse_buttons, result.mouse_wheel,
			                   true);
		}
		if (result.click_release) {
			// Schedule button release ~30ms after click press
			inject.click_release_mask = result.mouse_buttons;
			inject.click_release_at = millis() + 30;
		}
		if (result.needs_response) {
			if (result.text_response)
				tx_enqueue_str(result.text_response);
			static const uint8_t resp[] = { '>', '>', '>', '\r', '\n' };
			tx_enqueue_buf(resp, 5);
		}
	}
}
